app/controllers/flights_controller.rb

  def search
    if flight_params[:title].present? && flight_params[:url].present?
      scrapper = Scrapper.new(flight_params)
      scrapper.start
      @results = Flight.where(title: flight_params[:title]).select(:from, :to, :price)
---
SELECT "flights"."from", "flights"."to", "flights"."price" FROM "flights"  WHERE "flights"."title" = '5'