app/controllers/searches_controller.rb

INSERT INTO "searches" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-25 14:35:16.302610"], ["title", "123"], ["updated_at", "2014-08-25 14:35:16.302610"], ["url", "123"]]
---
  def create
    @search = Search.find_or_initialize_by search_params
    respond_to do |format|
      if @search.save